In [2]:
import pandas as pd
import numpy as np

### Creating and initiating Pandas Series

##### Using a List

In [4]:
s1 = pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

##### Using a NumPy Array

In [9]:
s2 = pd.Series(np.array([1,2,3,4]))
s3 = pd.Series(np.random.randint(4, size = 4), index=['a','b','c','d'])
s3

a    0
b    1
c    3
d    1
dtype: int32

In [10]:
s3['a']

0

##### Using a Dictionary

In [11]:
s4 = pd.Series({'a':1,'b':2,'c':3,'d':4})
s4

a    1
b    2
c    3
d    4
dtype: int64

##### Using a Scalar

In [13]:
# Create series using a scalar
s5 = pd.Series(100, index=np.arange(4,10))
s5

4    100
5    100
6    100
7    100
8    100
9    100
dtype: int64

### Creating and initiating Pandas DataFrame

##### Using a NumPy Array

In [16]:
df1 = pd.DataFrame(np.random.rand(2,3),index=['Ahmed','Sara'], columns=['A','B','C'])
df1

              A         B         C
Ahmed  0.215236  0.559890  0.846032
Sara   0.915798  0.537459  0.655059

In [20]:
df2 = pd.DataFrame(np.array([[1,2,3],[4,5,6]]), columns=['A','B','C'])
df2

   A  B  C
0  1  2  3
1  4  5  6

##### Using a Dictionary

In [22]:
dic = {'A':[1,2,3],'B':[4,5,6],'C':[7,8,9] }
df3 = pd.DataFrame(dic, index=['x','y','z'])
df3

   A  B  C
x  1  4  7
y  2  5  8
z  3  6  9

##### Using a Series Object

In [25]:
ser1 = pd.Series([1,2,3,4])
ser2 = pd.Series([4,5,6,7])
ser3 = pd.Series([7,8,9,10])

df4 = pd.DataFrame({'S1':ser1,'S2':ser2,'S3':ser3})
df4

   S1  S2  S3
0   1   4   7
1   2   5   8
2   3   6   9
3   4   7  10